In [18]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
from sqlalchemy import text
import getpass  # To get the password without showing the input
password = getpass.getpass()

bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

········

Engine(mysql+pymysql://root:***@localhost/sakila)

In [20]:
# 1 Establish a connection between Python and the Sakila database.
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)

with engine.connect() as connection:
    query = text('SELECT * FROM actor')
    result = connection.execute(query)
result

In [21]:
# 2
def rentals_month(engine,month:int,year:int):
    with engine.connect() as connection:
        txt = f'''select *,
                  year(rental_date) as 'year',
                  month(rental_date) as 'month'
                  from rental
                  where year(rental_date)={year} and month(rental_date)={month};'''
        
        query = text(txt)
        result = connection.execute(query)
        df  = pd.DataFrame(result.all())
        return df

In [12]:
rentals_month(engine,5,2005)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,year,month
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2005,5
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,2005,5
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,2005,5
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,2005,5
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,2005,5
...,...,...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53,2005,5
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53,2005,5
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53,2005,5
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53,2005,5
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53,2005,5

In [22]:
# 3
df = rentals_month(engine,5,2005)
df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,year,month
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2005,5
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,2005,5
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,2005,5
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,2005,5
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,2005,5
...,...,...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53,2005,5
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53,2005,5
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53,2005,5
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53,2005,5
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53,2005,5

In [23]:
df.groupby('customer_id').size() # can use size?

customer_id
1      2
2      1
3      2
5      3
6      3
      ..
594    4
595    1
596    6
597    2
599    1
Length: 520, dtype: int64

In [24]:
# 3
def rental_counts_month(df,month:int,year:int):
    column_name = f'rentals_{month}_{year}'
    rental_count_df = df.groupby('customer_id').size().reset_index(name=column_name)
    return rental_count_df

In [29]:
rentals_df = rentals_month(engine, month=8, year=2005)
rentals_df
rental_counts_df = rental_counts_month(rentals_df, month=8, year=2005)
rental_counts_df

     customer_id  rentals_8_2005
0              1              11
1              2              11
2              3               7
3              4              11
4              5              13
..           ...             ...
594          595               8
595          596              13
596          597              12
597          598               5
598          599               7

[599 rows x 2 columns]

In [15]:
rentals_df = rentals_month(engine, month=8, year=2005)
rental_counts_df = rental_counts_month(rentals_df, month=8, year=2005)
print(rental_counts_df.head())

   customer_id  rentals_8_2005
0            1              11
1            2              11
2            3               7
3            4              11
4            5              13

In [32]:
# merge of two datagrames y poner diferencia

df1 = rentals_month(engine, month=5, year=2005)
df2 = rentals_month(engine, month=6, year=2005)

rentals_df_1 = rental_counts_month(df1,5,2005)
rentals_df_2 = rental_counts_month(df2,6,2005)

In [40]:
# 4
def difference_rental(df1,df2):
    df = df1.merge(df2,on='customer_id',how='outer').fillna(0) # outer so that we can see people that rented on a month but no the other. fil NAN with 0
    df['difference'] = df[df.columns[1]] - df[df.columns[2]]
    return df

In [41]:
difference_rental(rentals_df_1,rentals_df_2)

     customer_id  rentals_5_2005  rentals_6_2005  difference
0              1             2.0             7.0        -5.0
1              2             1.0             1.0         0.0
2              3             2.0             4.0        -2.0
3              5             3.0             5.0        -2.0
4              6             3.0             4.0        -1.0
..           ...             ...             ...         ...
593          583             0.0             6.0        -6.0
594          585             0.0             4.0        -4.0
595          591             0.0             3.0        -3.0
596          592             0.0             5.0        -5.0
597          598             0.0             1.0        -1.0

[598 rows x 4 columns]